afc_saaspro_tax/afc_soap_apis/SOAP/CalcTaxesInCustModeV2-MultiTransaction-Request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/" xmlns:ezt="http://schemas.datacontract.org/2004/07/EZTaxWebService">
   <soap:Header>
      <UserName xmlns="http://eztaxasp.billsoft.com/eztaxwebservice">*****</UserName>
      <Password xmlns="http://eztaxasp.billsoft.com/eztaxwebservice">*****</Password>
   </soap:Header>
   <soap:Body>
      <tem:CalcTaxesInCustModeV2 xmlns="http://tempuri.org/">
         <tem:transactions xmlns:a="http://schemas.datacontract.org/2004/07/EZTaxWebService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
            <ezt:Transaction>
               <ezt:AdjustmentMethod>0</ezt:AdjustmentMethod>
               <ezt:BillToAddress>
                  <ezt:CountryISO>USA</ezt:CountryISO>
                  <ezt:County>Harris</ezt:County>
                  <ezt:Locality>Houston</ezt:Locality>
                  <ezt:State>TX</ezt:State>
                  <ezt:ZipCode>77003</ezt:ZipCode>
                  <ezt:ZipP4/>
               </ezt:BillToAddress>
               <ezt:BillToFipsCode i:nil="true"/>
               <ezt:BillToNpaNxx i:nil="true"/>
               <ezt:BillToPCode i:nil="true"/>
               <ezt:BusinessClass>1</ezt:BusinessClass>
               <ezt:CategoryExemptions i:nil="true"/>
               <ezt:Charge>100.0</ezt:Charge>
               <ezt:CompanyIdentifier>TST</ezt:CompanyIdentifier>
               <ezt:CountyExempt>false</ezt:CountyExempt>
               <ezt:CountyPCode>0</ezt:CountyPCode>
               <ezt:CustomerNumber>ABC</ezt:CustomerNumber>
               <ezt:CustomerType>1</ezt:CustomerType>
               <ezt:Date>2015-11-01T00:00:00</ezt:Date>
               <ezt:Debit>false</ezt:Debit>
               <ezt:DiscountType>0</ezt:DiscountType>
               <ezt:Exclusions i:nil="true"/>
               <ezt:Exclusions i:nil="true"/>
               <ezt:ExemptionType>0</ezt:ExemptionType>
               <ezt:Exemptions i:nil="true"/>
               <ezt:FacilitiesBased>false</ezt:FacilitiesBased>
               <ezt:FederalExempt>false</ezt:FederalExempt>
               <ezt:FederalPCode>0</ezt:FederalPCode>
               <ezt:Franchise>false</ezt:Franchise>
               <ezt:Incorporated>true</ezt:Incorporated>
               <ezt:InvoiceNumber>345</ezt:InvoiceNumber>
               <ezt:IsPrivateLine>false</ezt:IsPrivateLine>
               <ezt:Lifeline>false</ezt:Lifeline>
               <ezt:Lines>1</ezt:Lines>
               <ezt:LocalExempt>false</ezt:LocalExempt>
               <ezt:LocalPCode>0</ezt:LocalPCode>
               <ezt:Locations>0</ezt:Locations>
               <ezt:Minutes>0</ezt:Minutes>
               <ezt:Optional>123456</ezt:Optional>
               <ezt:Optional10>10</ezt:Optional10>
               <ezt:Optional4>4</ezt:Optional4>
               <ezt:Optional5>5</ezt:Optional5>
               <ezt:Optional6>6</ezt:Optional6>
               <ezt:Optional7>7</ezt:Optional7>
               <ezt:Optional8>8</ezt:Optional8>
               <ezt:Optional9>9</ezt:Optional9>
               <ezt:OptionalAlpha1>Line item 001</ezt:OptionalAlpha1>
               <ezt:OptionalFields>
                  <ezt:OptionalField>
                     <ezt:OptionalKeyNo>1</ezt:OptionalKeyNo>
                     <ezt:OptionalValue>TX tax calculation on 1/1 (Interstate/Toll)</ezt:OptionalValue>
                  </ezt:OptionalField>
               </ezt:OptionalFields>
               <ezt:OriginationAddress>
                  <ezt:CountryISO>USA</ezt:CountryISO>
                  <ezt:County i:nil="true"/>
                  <ezt:Locality>Overland Park</ezt:Locality>
                  <ezt:State>KS</ezt:State>
                  <ezt:ZipCode>66212</ezt:ZipCode>
                  <ezt:ZipP4>3382</ezt:ZipP4>
               </ezt:OriginationAddress>
               <ezt:OriginationFipsCode i:nil="true"/>
               <ezt:OriginationNpaNxx i:nil="true"/>
               <ezt:OriginationPCode i:nil="true"/>
               <ezt:PrivateLineSplit>0.00</ezt:PrivateLineSplit>
               <ezt:Regulated>false</ezt:Regulated>
               <ezt:Sale>true</ezt:Sale>
               <ezt:ServiceClass>1</ezt:ServiceClass>
               <ezt:ServiceLevelNumber>888</ezt:ServiceLevelNumber>
               <ezt:ServiceType>1</ezt:ServiceType>
               <ezt:StateExempt>false</ezt:StateExempt>
               <ezt:StatePCode>0</ezt:StatePCode>
               <ezt:TerminationAddress>
                  <ezt:CountryISO>USA</ezt:CountryISO>
                  <ezt:County>Harris</ezt:County>
                  <ezt:Locality>Houston</ezt:Locality>
                  <ezt:State>TX</ezt:State>
                  <ezt:ZipCode>77003</ezt:ZipCode>
                  <ezt:ZipP4/>
               </ezt:TerminationAddress>
               <ezt:TerminationFipsCode i:nil="true"/>
               <ezt:TerminationNpaNxx i:nil="true"/>
               <ezt:TerminationPCode i:nil="true"/>
               <ezt:TransactionType>1</ezt:TransactionType>
            </ezt:Transaction>
            <ezt:Transaction>
               <ezt:AdjustmentMethod>0</ezt:AdjustmentMethod>
               <ezt:BillToAddress i:nil="true"/>
               <ezt:BillToFipsCode i:nil="true"/>
               <ezt:BillToNpaNxx i:nil="true"/>
               <ezt:BillToPCode>819900</ezt:BillToPCode>
               <ezt:BusinessClass>1</ezt:BusinessClass>
               <ezt:Charge>100.0</ezt:Charge>
               <ezt:CompanyIdentifier>TST</ezt:CompanyIdentifier>
               <ezt:CountyExempt>false</ezt:CountyExempt>
               <ezt:CountyPCode>0</ezt:CountyPCode>
               <ezt:CustomerNumber>ABC</ezt:CustomerNumber>
               <ezt:CustomerType>1</ezt:CustomerType>
               <ezt:Date>2015-11-01T00:00:00</ezt:Date>
               <ezt:Debit>false</ezt:Debit>
               <ezt:DiscountType>0</ezt:DiscountType>
               <ezt:ExemptionType>0</ezt:ExemptionType>
               <ezt:Exemptions i:nil="true"/>
               <ezt:FacilitiesBased>false</ezt:FacilitiesBased>
               <ezt:FederalExempt>false</ezt:FederalExempt>
               <ezt:FederalPCode>0</ezt:FederalPCode>
               <ezt:Franchise>false</ezt:Franchise>
               <ezt:Incorporated>true</ezt:Incorporated>
               <ezt:InvoiceNumber>345</ezt:InvoiceNumber>
               <ezt:IsPrivateLine>false</ezt:IsPrivateLine>
               <ezt:Lifeline>false</ezt:Lifeline>
               <ezt:Lines>1</ezt:Lines>
               <ezt:LocalExempt>false</ezt:LocalExempt>
               <ezt:LocalPCode>0</ezt:LocalPCode>
               <ezt:Locations>0</ezt:Locations>
               <ezt:Minutes>0</ezt:Minutes>
               <ezt:Optional>123456</ezt:Optional>
               <ezt:Optional10>20171</ezt:Optional10>
               <ezt:Optional4>43215345</ezt:Optional4>
               <ezt:Optional5>5</ezt:Optional5>
               <ezt:Optional6>6</ezt:Optional6>
               <ezt:Optional7>7</ezt:Optional7>
               <ezt:Optional8>8</ezt:Optional8>
               <ezt:Optional9>9</ezt:Optional9>
               <ezt:OptionalAlpha1>Line item 002</ezt:OptionalAlpha1>
               <ezt:OptionalFields>
                  <ezt:OptionalField>
                     <ezt:OptionalKeyNo>1</ezt:OptionalKeyNo>
                     <ezt:OptionalValue>Chicago tax calculation on 1/1 (Interstate/Toll)</ezt:OptionalValue>
                  </ezt:OptionalField>
               </ezt:OptionalFields>
               <ezt:OriginationAddress i:nil="true"/>
               <ezt:OriginationFipsCode i:nil="true"/>
               <ezt:OriginationNpaNxx i:nil="true"/>
               <ezt:OriginationPCode>819900</ezt:OriginationPCode>
               <ezt:PrivateLineSplit>0.0</ezt:PrivateLineSplit>
               <ezt:Regulated>false</ezt:Regulated>
               <ezt:Sale>true</ezt:Sale>
               <ezt:ServiceClass>1</ezt:ServiceClass>
               <ezt:ServiceLevelNumber>888</ezt:ServiceLevelNumber>
               <ezt:ServiceType>1</ezt:ServiceType>
               <ezt:StateExempt>false</ezt:StateExempt>
               <ezt:StatePCode>0</ezt:StatePCode>
               <ezt:TerminationAddress i:nil="true"/>
               <ezt:TerminationFipsCode i:nil="true"/>
               <ezt:TerminationNpaNxx i:nil="true"/>
               <ezt:TerminationPCode>819900</ezt:TerminationPCode>
               <ezt:TransactionType>1</ezt:TransactionType>
            </ezt:Transaction>
         </tem:transactions>
         <adjustments xmlns:i="http://www.w3.org/2001/XMLSchema-instance"/>
         <sauTransactions i:nil="true" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"/>
         <sauAdjustments i:nil="true" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"/>
         <nexus i:nil="true" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"/>
         <exclusions i:nil="true" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"/>
         <tem:returnDetail>true</tem:returnDetail>
         <tem:documentCode>Test CalcTaxesInCustModeV2 Tax Calculation Call 2017.06.20</tem:documentCode>
         <tem:commit>true</tem:commit>
      </tem:CalcTaxesInCustModeV2>
   </soap:Body>
</soap:Envelope>